<template>
  <div class="faq">
    <div class="container">
      <h1 class="h1">Часто задаваемые вопросы (FAQ)</h1>
      <div class="faq-spoilers">
        <UiSpoiler v-for="item in data" :key="item.title">
          <template #title>{{ item.title }}</template>
          <template #content> {{ item.content }}</template>
        </UiSpoiler>
      </div>
      <div class="">
        Если у вас есть специфические вопросы или темы, которые вы хотите
        включить, дайте знать - электронная почта для связи
        <a class="link" :href="`mailto:${MAIL}`">{{ MAIL }}</a>
      </div>
    </div>
  </div>
</template>

<script setup>
const data = [
  {
    title: "Как сделать заказ?",
    content:
      "Чтобы сделать заказ, выберите интересующий вас товар, добавьте его в корзину, а затем перейдите к оформлению заказа. Следуйте инструкциям на экране для завершения покупки.",
  },
  {
    title: "Как оплатить заказ?",
    content:
      "Мы принимаем различные способы оплаты, включая кредитные и дебетовые карты, электронные кошельки и банковские переводы. Вы можете выбрать наиболее удобный способ на этапе оформления заказа.",
  },
  {
    title: "Какие варианты доставки доступны?",
    content:
      "Мы предлагаем различные варианты доставки, включая курьерскую службу, почтовые службы и самовывоз из наших пунктов выдачи. Доступные варианты будут показаны в процессе оформления заказа.",
  },
  {
    title: "Как отслеживать статус заказа?",
    content:
      "После оформления заказа вы получите электронное письмо с номером отслеживания, который позволит вам следить за статусом доставки.",
  },
  {
    title: "Что делать, если я получил поврежденный товар?",
    content:
      "Если вы получили поврежденный товар, пожалуйста, свяжитесь с нашей службой поддержки в течение 14 дней с момента получения. Мы обсудим с вами варианты возврата или обмена товара.",
  },
  {
    title: "Как осуществляется возврат товара?",
    content:
      "Вы можете вернуть товар в течение 30 дней с момента покупки, если он не использовался и сохранены все упаковочные материалы. Пожалуйста, свяжитесь с нашей службой поддержки для получения инструкций по возврату.",
  },
  {
    title: "Есть ли гарантия на продукцию?",
    content:
      "Да, большинство товаров в нашем магазине имеют заводскую гарантию от производителя. Пожалуйста, ознакомьтесь с условиями гарантии конкретного товара на странице продукта.",
  },
  {
    title: "Могу ли я изменить или отменить заказ после оформления?",
    content:
      "Вы можете изменить или отменить свой заказ в течение 1 часа после его оформления. Свяжитесь с нашей службой поддержки как можно скорее, чтобы мы могли помочь вам.",
  },
  // {
  //   title: "Как получить скидки и специальные предложения?",
  //   content:"Подпишитесь на нашу рассылку и следите за обновлениями на сайте, чтобы не пропустить специальные предложения и акции."
  // },
];

const MAIL = "dada@dd.com";
</script>

<style lang="scss" scoped>
.faq {
  &-spoilers {
    display: grid;
    row-gap: 16px;
    margin-bottom: 20px;
  }
}
</style>
